<?php
require_once($_SERVER['DOCUMENT_ROOT']."/backend/Class/User.php");
require_once($_SERVER['DOCUMENT_ROOT']."/backend/Class/Role.php");
require_once($_SERVER['DOCUMENT_ROOT']."/backend/Class/balance/Balance.php");

$User = new User();
$balance = new Balance();

$Role= new Role();
?>

<div class="my-header col-12 d-flex align-items-center">
    <img class="mx-3 cursor my-auto" onclick="btnMenu()" width="25" src="/res/img/markup/header/markup-icon.png">

    <div class="col-11">
        <div class="myContainer d-flex justify-content-between align-items-center">
            <div class="col-7">
                <a class="text-14 text-decoration-none my-auto a-header-orders text-white text-opacity-50 fw-bolder white-hover" href="/page/client/orders">Мои заказы</a>
                <a class="text-14 text-decoration-none text-white text-opacity-50 fw-bolder white-hover my-auto mx-3 a-header-balance" href="/page/client/balance">Баланс</a>
                <a class="text-14 text-decoration-none text-white text-opacity-50 fw-bolder white-hover my-auto mx-3 a-header-favorites" href="/page/client/favorites">Избранные</a>
                <a class="text-14 text-decoration-none text-white text-opacity-50 fw-bolder white-hover my-auto mx-3 a-header-referral_program" href="/page/client/referral_program">Реферальная программа</a>
            </div>

            <div class="d-flex col-5 align-items-center justify-content-end">
                <div class="d-flex justify-content-center align-items-center cursor col-2">
                    <a href="/page/client/balance" class="my-auto mx-1 text-light text-decoration-none text-opacity-75">
                        <?php echo number_format($balance->ReturnBalance('balance_client'), 0, '', ' '); ?> ₽</a>
                </div>

                <a href="#" class="d-flex justify-content-start align-items-center cursor col-1 mx-4 svg_message_header">
                    <svg width="25" height="20" viewBox="0 0 27 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M2.28473 0.262846C2.10055 0.0937852 1.85979 0 1.60994 0C1.59548 0 1.58101 0.000314713 1.56656 0.00094384C1.30197 0.0124641 1.05277 0.12877 0.873809 0.324275C0.704983 0.508705 0.611328 0.749808 0.611328 1C0.611328 1.01448 0.611642 1.02897 0.612271 1.04344C0.623775 1.3084 0.73992 1.55794 0.935154 1.73715L12.9185 12.7372C13.3003 13.0876 13.8863 13.0876 14.2681 12.7372L26.2508 1.73777C26.4571 1.54836 26.5753 1.28031 26.5753 1L26.5752 0.991686C26.5732 0.744371 26.4797 0.506591 26.3128 0.324275C26.1338 0.12877 25.8846 0.0124643 25.62 0.000943899C25.6056 0.000314772 25.5911 5.96046e-08 25.5767 5.96046e-08L25.5721 1.06096e-05C25.3238 0.00115496 25.0849 0.0948582 24.9019 0.262846L13.5933 10.6434L2.28473 0.262846Z" fill="white" fill-opacity="0.85"/>
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M0.611328 18V1C0.611328 0.447715 1.05842 0 1.60994 0L25.5767 5.96046e-08C26.1282 5.96046e-08 26.5753 0.447715 26.5753 1V18C26.5753 18 26.5753 18.8284 25.9903 19.4142C25.9903 19.4142 25.4053 20 24.578 20H2.60855C2.60855 20 1.78128 20 1.1963 19.4142C1.1963 19.4142 0.611328 18.8284 0.611328 18ZM2.60855 18H24.578V2H2.60855V18Z" fill="white" fill-opacity="0.85"/>
                        <path d="M10.7339 9.26301L1.24704 17.9755C1.04081 18.1649 0.923395 18.4323 0.923395 18.7125L0.923431 18.7211C0.925543 18.9684 1.0191 19.2061 1.18604 19.3884C1.37518 19.5949 1.64217 19.7125 1.92201 19.7125L1.93055 19.7125C2.17752 19.7103 2.41495 19.6167 2.59697 19.4495L12.0838 10.737C12.29 10.5476 12.4074 10.2802 12.4074 10L12.4074 9.99145C12.4053 9.74413 12.3117 9.50638 12.1448 9.3241C11.9658 9.12864 11.7166 9.01239 11.452 9.00093C11.4376 9.00031 11.4232 9 11.4088 9L11.404 9.00001C11.1557 9.00122 10.9168 9.09498 10.7339 9.26301Z" fill="white" fill-opacity="0.85"/>
                        <path d="M25.9396 17.9755L16.4527 9.26301C16.2685 9.09385 16.0277 9 15.7778 9C15.7634 9 15.749 9.00031 15.7346 9.00093C15.47 9.01239 15.2208 9.12864 15.0418 9.3241C14.8729 9.50855 14.7792 9.74973 14.7792 10C14.7792 10.0144 14.7795 10.0288 14.7801 10.0432C14.7915 10.3082 14.9076 10.5577 15.1028 10.737L24.5894 19.4493C24.7736 19.6184 25.0147 19.7125 25.2646 19.7125C25.279 19.7125 25.2934 19.7122 25.3077 19.7116C25.5723 19.7001 25.8215 19.5839 26.0006 19.3884C26.1695 19.204 26.2632 18.9628 26.2632 18.7125C26.2632 18.6981 26.2629 18.6837 26.2623 18.6693C26.2508 18.4043 26.1347 18.1548 25.9396 17.9755Z" fill="white" fill-opacity="0.85"/>
                    </svg>

                    <svg class="svg_message_header_active d-none"  width="25" height="20" viewBox="0 0 27 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M2.28473 0.262846C2.10055 0.0937852 1.85979 0 1.60994 0C1.59548 0 1.58101 0.000314713 1.56656 0.00094384C1.30197 0.0124641 1.05277 0.12877 0.873809 0.324275C0.704983 0.508705 0.611328 0.749808 0.611328 1C0.611328 1.01448 0.611642 1.02897 0.612271 1.04344C0.623775 1.3084 0.73992 1.55794 0.935154 1.73715L12.9185 12.7372C13.3003 13.0876 13.8863 13.0876 14.2681 12.7372L26.2508 1.73777C26.4571 1.54836 26.5753 1.28031 26.5753 1L26.5752 0.991686C26.5732 0.744371 26.4797 0.506591 26.3128 0.324275C26.1338 0.12877 25.8846 0.0124643 25.62 0.000943899C25.6056 0.000314772 25.5911 5.96046e-08 25.5767 5.96046e-08L25.5721 1.06096e-05C25.3238 0.00115496 25.0849 0.0948582 24.9019 0.262846L13.5933 10.6434L2.28473 0.262846Z" fill="#1877F2"/>
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M0.611328 18V1C0.611328 0.447715 1.05842 0 1.60994 0L25.5767 5.96046e-08C26.1282 5.96046e-08 26.5753 0.447715 26.5753 1V18C26.5753 18 26.5753 18.8284 25.9903 19.4142C25.9903 19.4142 25.4053 20 24.578 20H2.60855C2.60855 20 1.78128 20 1.1963 19.4142C1.1963 19.4142 0.611328 18.8284 0.611328 18ZM2.60855 18H24.578V2H2.60855V18Z" fill="#1877F2"/>
                        <path d="M10.7339 9.26301L1.24704 17.9755C1.04081 18.1649 0.923395 18.4323 0.923395 18.7125L0.923431 18.7211C0.925543 18.9684 1.0191 19.2061 1.18604 19.3884C1.37518 19.5949 1.64217 19.7125 1.92201 19.7125L1.93055 19.7125C2.17752 19.7103 2.41495 19.6167 2.59697 19.4495L12.0838 10.737C12.29 10.5476 12.4074 10.2802 12.4074 10L12.4074 9.99145C12.4053 9.74413 12.3117 9.50638 12.1448 9.3241C11.9658 9.12864 11.7166 9.01239 11.452 9.00093C11.4376 9.00031 11.4232 9 11.4088 9L11.404 9.00001C11.1557 9.00122 10.9168 9.09498 10.7339 9.26301Z" fill="#1877F2"/>
                        <path d="M25.9396 17.9755L16.4527 9.26301C16.2685 9.09385 16.0277 9 15.7778 9C15.7634 9 15.749 9.00031 15.7346 9.00093C15.47 9.01239 15.2208 9.12864 15.0418 9.3241C14.8729 9.50855 14.7792 9.74973 14.7792 10C14.7792 10.0144 14.7795 10.0288 14.7801 10.0432C14.7915 10.3082 14.9076 10.5577 15.1028 10.737L24.5894 19.4493C24.7736 19.6184 25.0147 19.7125 25.2646 19.7125C25.279 19.7125 25.2934 19.7122 25.3077 19.7116C25.5723 19.7001 25.8215 19.5839 26.0006 19.3884C26.1695 19.204 26.2632 18.9628 26.2632 18.7125C26.2632 18.6981 26.2629 18.6837 26.2623 18.6693C26.2508 18.4043 26.1347 18.1548 25.9396 17.9755Z" fill="#1877F2"/>
                    </svg>
                </a>

                <a href="/page/client/messages.php" class="d-flex justify-content-start align-items-center cursor col-1 mx-4 svg_message_header_active d-none">
                    <svg width="25" height="20" viewBox="0 0 27 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M2.28473 0.262846C2.10055 0.0937852 1.85979 0 1.60994 0C1.59548 0 1.58101 0.000314713 1.56656 0.00094384C1.30197 0.0124641 1.05277 0.12877 0.873809 0.324275C0.704983 0.508705 0.611328 0.749808 0.611328 1C0.611328 1.01448 0.611642 1.02897 0.612271 1.04344C0.623775 1.3084 0.73992 1.55794 0.935154 1.73715L12.9185 12.7372C13.3003 13.0876 13.8863 13.0876 14.2681 12.7372L26.2508 1.73777C26.4571 1.54836 26.5753 1.28031 26.5753 1L26.5752 0.991686C26.5732 0.744371 26.4797 0.506591 26.3128 0.324275C26.1338 0.12877 25.8846 0.0124643 25.62 0.000943899C25.6056 0.000314772 25.5911 5.96046e-08 25.5767 5.96046e-08L25.5721 1.06096e-05C25.3238 0.00115496 25.0849 0.0948582 24.9019 0.262846L13.5933 10.6434L2.28473 0.262846Z" fill="#1877F2"/>
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M0.611328 18V1C0.611328 0.447715 1.05842 0 1.60994 0L25.5767 5.96046e-08C26.1282 5.96046e-08 26.5753 0.447715 26.5753 1V18C26.5753 18 26.5753 18.8284 25.9903 19.4142C25.9903 19.4142 25.4053 20 24.578 20H2.60855C2.60855 20 1.78128 20 1.1963 19.4142C1.1963 19.4142 0.611328 18.8284 0.611328 18ZM2.60855 18H24.578V2H2.60855V18Z" fill="#1877F2"/>
                        <path d="M10.7339 9.26301L1.24704 17.9755C1.04081 18.1649 0.923395 18.4323 0.923395 18.7125L0.923431 18.7211C0.925543 18.9684 1.0191 19.2061 1.18604 19.3884C1.37518 19.5949 1.64217 19.7125 1.92201 19.7125L1.93055 19.7125C2.17752 19.7103 2.41495 19.6167 2.59697 19.4495L12.0838 10.737C12.29 10.5476 12.4074 10.2802 12.4074 10L12.4074 9.99145C12.4053 9.74413 12.3117 9.50638 12.1448 9.3241C11.9658 9.12864 11.7166 9.01239 11.452 9.00093C11.4376 9.00031 11.4232 9 11.4088 9L11.404 9.00001C11.1557 9.00122 10.9168 9.09498 10.7339 9.26301Z" fill="#1877F2"/>
                        <path d="M25.9396 17.9755L16.4527 9.26301C16.2685 9.09385 16.0277 9 15.7778 9C15.7634 9 15.749 9.00031 15.7346 9.00093C15.47 9.01239 15.2208 9.12864 15.0418 9.3241C14.8729 9.50855 14.7792 9.74973 14.7792 10C14.7792 10.0144 14.7795 10.0288 14.7801 10.0432C14.7915 10.3082 14.9076 10.5577 15.1028 10.737L24.5894 19.4493C24.7736 19.6184 25.0147 19.7125 25.2646 19.7125C25.279 19.7125 25.2934 19.7122 25.3077 19.7116C25.5723 19.7001 25.8215 19.5839 26.0006 19.3884C26.1695 19.204 26.2632 18.9628 26.2632 18.7125C26.2632 18.6981 26.2629 18.6837 26.2623 18.6693C26.2508 18.4043 26.1347 18.1548 25.9396 17.9755Z" fill="#1877F2"/>
                    </svg>
                </a>

                <div class="d-flex align-items-center cursor col-5 position-relative">
                    <img class="rounded-5 position-absolute" width="35" height="35" src="/res/img/markup/header/elipse.svg" style="z-index: 111111;">

                    <div class="select select_standard header_name_account mx-4">
                        <input class="select__input select__input_standard" type="hidden" name="">
                        <div class="select__head select__head_standard p-1 text-white"><?php echo $User->ReturnInfoUser('name'); ?></div>
                        <ul class="select__list select__list_standard bg-opacity-50 rounded-top rounded-2" style="display: none;">

                            <?php

                            if ($Role->Check('admin')) {
                                echo '<a class="text-decoration-none text-white" href="/page/admin/dashboard">
                                <li class="select__item select__item_standard mt-1 py-1">Администратор</li>
                            </a>';
                            }

                            ?>

                            <a class="text-decoration-none text-white" href="/page/public/main">
                                <li class="select__item select__item_standard mt-1 py-1">Клиент</li>
                            </a>

                            <a class="text-decoration-none text-white" href="/page/seller/main">
                                <li class="select__item select__item_standard mt-1 py-1">Поставщик</li>
                            </a>

                            <a class="text-decoration-none text-white" href="/page/client/profile">
                                <li class="select__item select__item_standard mt-1 py-1">Мой профиль</li>
                            </a>

                            <a class="text-decoration-none text-white" href="/backend/script/entry_system/logout">
                                <li class="select__item select__item_standard mt-1 py-1">Выйти</li>
                            </a>
                        </ul>
                    </div>

                </div>
            </div>
        </div>
    </div>
</div>